{"cursor":"3151","size":15,"audio":[],"currentlang":"en","article":"\nIn standardization, a 'profile' consists of an agreed-upon subset and\ninterpretation of a specification. Many complex technical specifications have\nmany optional features, such that two conforming implementations may not inter-\noperate due to choosing different sets of optional features to support. Even\nwhen no formal optional features exist within a standard, vendors will often\nfail to implement (or fail to implement correctly) functionality from the\nstandard which they view as unimportant. In particular, implementations of\nstandards on mobile devices often have significant limitations compared to their\ntraditional desktop implementations, even if the standard which governs both\npermits such limitations. Also, some writers of standards sometimes produce\nvague or ambiguous specifications, often unintentionally, but sometimes by\nintention. The use of profiles can enforce one possible interpretation.\n\nUsers can utilize profiles to ensure interoperability, and in procurement.\n\nIn some cases, profiles themselves can become standardised: for example, US-\nGOSIP, UK-GOSIP and the ISO ISP (International Standard Profile) series in the\ncontext of OSI networking, and the various mobile profiles adopted by the W3C\nfor web standards.\n\nIn fabricating, a 'profile' consists of the more-or-less complex outline of a\nshape to be cut in a sheet of material such as laminated plastic, aluminium\nalloy or steel plate. In modern practice, a drawing office determines the shape\nand dimensions required to fit the sheet into a larger work and feeds directions\nto a computer controlling a profile cutter. This then cuts the shape from a standard-\nsized sheet. The cutting head may use a rotating cutter like that of a spindle\nrouter or (in the case of steel plate) a torch which burns oxy-acetylene or\nother oxy-gas.\n\nIn structural engineering a 'profile' means a hot rolled structural steel shape\nlike an {{ibeam}}-beam.\n\nIn civil engineering, a 'profile' consists of a plotted line which indicates\ngrades and distances (and typically depths of cut and/or elevations of fill) for\nexcavation and grading work. Constructors of roadways, railways (and similar\nworks) normally chart the profile along the centerline. A profile can also\nindicate the vertical slope(s) (changes in elevation) in a pipeline or similar\nstructure. Civil engineers always depict profile as a side (cross section) view\n(as opposed to an overhead (plan) view).\n","linknr":105,"url":"Profile_(engineering)","recorded":1362675885,"links":14,"instances":["metal","geometry"],"pdf":[],"categories":["Standards","Engineering concepts"],"headings":["See also"],"image":["//upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png","//bits.wikimedia.org/static-1.21wmf10/skins/vector/images/search-ltr.png?303-4","//bits.wikimedia.org/images/wikimedia-button.png","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/poweredby_mediawiki_88x31.png"],"tags":[["fabrication","metal"],["cross_section","geometry"]],"members":["fabrication","cross_section"],"related":["Standardization","Specification","Government_Open_Systems_Interconnection_Profile","International_Organization_for_Standardization","Open_Systems_Interconnection","W3C","Fabrication_(metal)","Steel","Profile_cutter","Oxyacetylene","Structural_engineering","Hot_rolling","I-beam","Civil_engineering","Road","Rail_transport","Pipeline_transport","Cross_section_(geometry)","Plan_view","Hollow_structural_section","Rail_profile","Structural_steel"]}